# Basic Pandas

In [1]:
import pandas as pd

In [40]:
# creat dataframe from scratch

raw_data = {
    "name" : ["Fa", "Anna", "Joe", "Marry", "Rose"],
    "age" : [27,26,28,25,23],
    "gender" : ["F", "F", "M", "F", "F"],
}

pd.DataFrame(raw_data)

,name,age,gender
0,Fa,27,F
1,Anna,26,F
2,Joe,28,M
3,Marry,25,F
4,Rose,23,F

In [41]:
df = pd.DataFrame(raw_data)
df

,name,age,gender
0,Fa,27,F
1,Anna,26,F
2,Joe,28,M
3,Marry,25,F
4,Rose,23,F

In [42]:
df["city"] = "London"
df

,name,age,gender,city
0,Fa,27,F,London
1,Anna,26,F,London
2,Joe,28,M,London
3,Marry,25,F,London
4,Rose,23,F,London

In [43]:
df["city"] = ["London","Manchester","Liverpool","London","London"]
df

,name,age,gender,city
0,Fa,27,F,London
1,Anna,26,F,Manchester
2,Joe,28,M,Liverpool
3,Marry,25,F,London
4,Rose,23,F,London

In [44]:
# drop column 
df = df.drop("city", axis=1)
df

,name,age,gender
0,Fa,27,F
1,Anna,26,F
2,Joe,28,M
3,Marry,25,F
4,Rose,23,F

In [45]:
# drop row/index
df = df.drop(2, axis=0)
df

,name,age,gender
0,Fa,27,F
1,Anna,26,F
3,Marry,25,F
4,Rose,23,F

In [46]:
# reset index

df = df.reset_index(drop=True)
df

,name,age,gender
0,Fa,27,F
1,Anna,26,F
2,Marry,25,F
3,Rose,23,F

In [47]:
# column names
list(df.columns)

['name', 'age', 'gender']

In [48]:
# rename column
df.columns = ["nickname","age","sex"]
df

,nickname,age,sex
0,Fa,27,F
1,Anna,26,F
2,Marry,25,F
3,Rose,23,F

In [49]:
type(df["nickname"])

pandas.core.series.Series

In [50]:
type(df)

pandas.core.frame.DataFrame

In [51]:
# creat a new series
s1 = pd.Series(["Joe","26","M"], index=["nickname","age","sex"])
print(s1)
print(type(s1))

nickname    Joe
age          26
sex           M
dtype: object
<class 'pandas.core.series.Series'>

In [52]:
# append
df = df.append(s1, ignore_index=True)
df

<ipython-input-52-be5a6dff9d75>:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(s1, ignore_index=True)

,nickname,age,sex
0,Fa,27,F
1,Anna,26,F
2,Marry,25,F
3,Rose,23,F
4,Joe,26,M

In [53]:
s2 = pd.Series(["London","Manchester","Liverpool","London","London"])
df["city"] = s2
df

,nickname,age,sex,city
0,Fa,27,F,London
1,Anna,26,F,Manchester
2,Marry,25,F,Liverpool
3,Rose,23,F,London
4,Joe,26,M,London

In [54]:
# write csv file
df.to_csv("mydata.csv")

In [55]:
# import csv file
df2 = pd.read_csv("data/data.csv")
df2

,id,name,city
0,1,John,London
1,2,Joe,Liverpool
2,3,Mary,Manchester
3,4,Anna,Swansea
4,5,David,London

In [2]:
# import excel file
df3 = pd.read_excel("data/data.xlsx")
df3

,id,name,city
0,1,John,London
1,2,Joe,Liverpool
2,3,Mary,Manchester
3,4,Anna,Swansea
4,5,David,London

In [3]:
# import json file
df4 = pd.read_json("data/data.json")
df4

,ebook,language,amazonRating
0,Getting started with Python,python,4.89
1,Introduction to R,r,4.88
2,SQL for Beginners,sql,4.75